7767517
244 292
Input                    in0                      0 1 in0
Convolution              conv_0                   1 1 in0 1 0=16 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=432
Swish                    silu_82                  1 1 1 2
Convolution              conv_1                   1 1 2 3 0=32 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=4608
Swish                    silu_83                  1 1 3 4
Convolution              conv_2                   1 1 4 5 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
Swish                    silu_84                  1 1 5 6
Slice                    split_0                  1 2 6 7 8 -23300=2,16,16 1=0
Split                    splitncnn_0              1 3 8 9 10 11
Convolution              conv_3                   1 1 11 12 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Swish                    silu_85                  1 1 12 13
Convolution              conv_4                   1 1 13 14 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Swish                    silu_86                  1 1 14 15
BinaryOp                 add_0                    2 1 10 15 16 0=0
Concat                   cat_0                    3 1 7 9 16 17 0=0
Convolution              conv_5                   1 1 17 18 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1536
Swish                    silu_87                  1 1 18 19
Split                    splitncnn_1              1 2 19 20 21
Convolution              conv_6                   1 1 21 22 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=18432
Swish                    silu_88                  1 1 22 23
Convolution              conv_7                   1 1 23 24 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_89                  1 1 24 25
Slice                    split_1                  1 2 25 26 27 -23300=2,32,32 1=0
Split                    splitncnn_2              1 3 27 28 29 30
Convolution              conv_8                   1 1 30 31 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_90                  1 1 31 32
Convolution              conv_9                   1 1 32 33 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_91                  1 1 33 34
BinaryOp                 add_1                    2 1 29 34 35 0=0
Split                    splitncnn_3              1 3 35 36 37 38
Convolution              conv_10                  1 1 38 39 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_92                  1 1 39 40
Convolution              conv_11                  1 1 40 41 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_93                  1 1 41 42
BinaryOp                 add_2                    2 1 37 42 43 0=0
Concat                   cat_1                    4 1 26 28 36 43 44 0=0
Convolution              conv_12                  1 1 44 45 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_94                  1 1 45 46
Split                    splitncnn_4              1 2 46 47 48
Convolution              conv_13                  1 1 48 49 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=73728
Swish                    silu_95                  1 1 49 50
Convolution              conv_14                  1 1 50 51 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_96                  1 1 51 52
Slice                    split_2                  1 2 52 53 54 -23300=2,64,64 1=0
Split                    splitncnn_5              1 3 54 55 56 57
Convolution              conv_15                  1 1 57 58 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_97                  1 1 58 59
Convolution              conv_16                  1 1 59 60 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_98                  1 1 60 61
BinaryOp                 add_3                    2 1 56 61 62 0=0
Split                    splitncnn_6              1 3 62 63 64 65
Convolution              conv_17                  1 1 65 66 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_99                  1 1 66 67
Convolution              conv_18                  1 1 67 68 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_100                 1 1 68 69
BinaryOp                 add_4                    2 1 64 69 70 0=0
Concat                   cat_2                    4 1 53 55 63 70 71 0=0
Convolution              conv_19                  1 1 71 72 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_101                 1 1 72 73
Split                    splitncnn_7              1 2 73 74 75
Convolution              conv_20                  1 1 75 76 0=256 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=294912
Swish                    silu_102                 1 1 76 77
Convolution              conv_21                  1 1 77 78 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_103                 1 1 78 79
Slice                    split_3                  1 2 79 80 81 -23300=2,128,128 1=0
Split                    splitncnn_8              1 3 81 82 83 84
Convolution              conv_22                  1 1 84 85 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_104                 1 1 85 86
Convolution              conv_23                  1 1 86 87 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_105                 1 1 87 88
BinaryOp                 add_5                    2 1 83 88 89 0=0
Concat                   cat_3                    3 1 80 82 89 90 0=0
Convolution              conv_24                  1 1 90 91 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=98304
Swish                    silu_106                 1 1 91 92
Convolution              conv_25                  1 1 92 93 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_107                 1 1 93 94
Split                    splitncnn_9              1 2 94 95 96
Pooling                  maxpool2d_79             1 1 96 97 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_10             1 2 97 98 99
Pooling                  maxpool2d_80             1 1 99 100 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_11             1 2 100 101 102
Pooling                  maxpool2d_81             1 1 102 103 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Concat                   cat_4                    4 1 95 98 101 103 104 0=0
Convolution              conv_26                  1 1 104 105 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_108                 1 1 105 106
Split                    splitncnn_12             1 2 106 107 108
Interp                   upsample_152             1 1 108 109 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_5                    2 1 109 74 110 0=0
Convolution              conv_27                  1 1 110 111 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=49152
Swish                    silu_109                 1 1 111 112
Slice                    split_4                  1 2 112 113 114 -23300=2,64,64 1=0
Split                    splitncnn_13             1 2 114 115 116
Convolution              conv_28                  1 1 116 117 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_110                 1 1 117 118
Convolution              conv_29                  1 1 118 119 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_111                 1 1 119 120
Concat                   cat_6                    3 1 113 115 120 121 0=0
Convolution              conv_30                  1 1 121 122 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
Swish                    silu_112                 1 1 122 123
Split                    splitncnn_14             1 2 123 124 125
Interp                   upsample_153             1 1 125 126 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_7                    2 1 126 47 127 0=0
Convolution              conv_31                  1 1 127 128 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=12288
Swish                    silu_113                 1 1 128 129
Slice                    split_5                  1 2 129 130 131 -23300=2,32,32 1=0
Split                    splitncnn_15             1 2 131 132 133
Convolution              conv_32                  1 1 133 134 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_114                 1 1 134 135
Convolution              conv_33                  1 1 135 136 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_115                 1 1 136 137
Concat                   cat_8                    3 1 130 132 137 138 0=0
Convolution              conv_34                  1 1 138 139 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6144
Swish                    silu_116                 1 1 139 140
Split                    splitncnn_16             1 2 140 141 142
Interp                   upsample_154             1 1 142 143 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_9                    2 1 143 20 144 0=0
Convolution              conv_35                  1 1 144 145 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3072
Swish                    silu_117                 1 1 145 146
Slice                    split_6                  1 2 146 147 148 -23300=2,16,16 1=0
Split                    splitncnn_17             1 2 148 149 150
Convolution              conv_36                  1 1 150 151 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Swish                    silu_118                 1 1 151 152
Convolution              conv_37                  1 1 152 153 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Swish                    silu_119                 1 1 153 154
Concat                   cat_10                   3 1 147 149 154 155 0=0
Convolution              conv_38                  1 1 155 156 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1536
Swish                    silu_120                 1 1 156 157
Split                    splitncnn_18             1 3 157 158 159 160
Convolution              conv_39                  1 1 160 161 0=32 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=9216
Swish                    silu_121                 1 1 161 162
Concat                   cat_11                   2 1 162 141 163 0=0
Convolution              conv_40                  1 1 163 164 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6144
Swish                    silu_122                 1 1 164 165
Slice                    split_7                  1 2 165 166 167 -23300=2,32,32 1=0
Split                    splitncnn_19             1 2 167 168 169
Convolution              conv_41                  1 1 169 170 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_123                 1 1 170 171
Convolution              conv_42                  1 1 171 172 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_124                 1 1 172 173
Concat                   cat_12                   3 1 166 168 173 174 0=0
Convolution              conv_43                  1 1 174 175 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6144
Swish                    silu_125                 1 1 175 176
Split                    splitncnn_20             1 3 176 177 178 179
Convolution              conv_44                  1 1 179 180 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=36864
Swish                    silu_126                 1 1 180 181
Concat                   cat_13                   2 1 181 124 182 0=0
Convolution              conv_45                  1 1 182 183 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
Swish                    silu_127                 1 1 183 184
Slice                    split_8                  1 2 184 185 186 -23300=2,64,64 1=0
Split                    splitncnn_21             1 2 186 187 188
Convolution              conv_46                  1 1 188 189 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_128                 1 1 189 190
Convolution              conv_47                  1 1 190 191 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_129                 1 1 191 192
Concat                   cat_14                   3 1 185 187 192 193 0=0
Convolution              conv_48                  1 1 193 194 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
Swish                    silu_130                 1 1 194 195
Split                    splitncnn_22             1 3 195 196 197 198
Convolution              conv_49                  1 1 198 199 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=147456
Swish                    silu_131                 1 1 199 200
Concat                   cat_15                   2 1 200 107 201 0=0
Convolution              conv_50                  1 1 201 202 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=98304
Swish                    silu_132                 1 1 202 203
Slice                    split_9                  1 2 203 204 205 -23300=2,128,128 1=0
Split                    splitncnn_23             1 2 205 206 207
Convolution              conv_51                  1 1 207 208 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_133                 1 1 208 209
Convolution              conv_52                  1 1 209 210 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_134                 1 1 210 211
Concat                   cat_16                   3 1 204 206 211 212 0=0
Convolution              conv_53                  1 1 212 213 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=98304
Swish                    silu_135                 1 1 213 214
Split                    splitncnn_24             1 2 214 215 216
MemoryData               pnnx_123                 0 1 217 0=34000
Convolution              conv_54                  1 1 159 218 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432
Swish                    silu_136                 1 1 218 219
Convolution              conv_55                  1 1 219 220 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_137                 1 1 220 221
Convolution              conv_56                  1 1 221 222 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Convolution              conv_57                  1 1 158 223 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_138                 1 1 223 224
Convolution              conv_58                  1 1 224 225 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_139                 1 1 225 226
Convolution              conv_59                  1 1 226 227 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32
Concat                   cat_17                   2 1 222 227 228 0=0
Convolution              conv_60                  1 1 178 229 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_140                 1 1 229 230
Convolution              conv_61                  1 1 230 231 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_141                 1 1 231 232
Convolution              conv_62                  1 1 232 233 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Convolution              conv_63                  1 1 177 234 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432
Swish                    silu_142                 1 1 234 235
Convolution              conv_64                  1 1 235 236 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_143                 1 1 236 237
Convolution              conv_65                  1 1 237 238 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32
Concat                   cat_18                   2 1 233 238 239 0=0
Convolution              conv_66                  1 1 197 240 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728
Swish                    silu_144                 1 1 240 241
Convolution              conv_67                  1 1 241 242 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_145                 1 1 242 243
Convolution              conv_68                  1 1 243 244 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Convolution              conv_69                  1 1 196 245 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_146                 1 1 245 246
Convolution              conv_70                  1 1 246 247 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_147                 1 1 247 248
Convolution              conv_71                  1 1 248 249 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32
Concat                   cat_19                   2 1 244 249 250 0=0
Convolution              conv_72                  1 1 216 251 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_148                 1 1 251 252
Convolution              conv_73                  1 1 252 253 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_149                 1 1 253 254
Convolution              conv_74                  1 1 254 255 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Convolution              conv_75                  1 1 215 256 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728
Swish                    silu_150                 1 1 256 257
Convolution              conv_76                  1 1 257 258 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_151                 1 1 258 259
Convolution              conv_77                  1 1 259 260 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32
Concat                   cat_20                   2 1 255 260 261 0=0
Reshape                  view_158                 1 1 228 262 0=25600 1=65
Reshape                  view_159                 1 1 239 263 0=6400 1=65
Reshape                  view_160                 1 1 250 264 0=1600 1=65
Reshape                  view_161                 1 1 261 265 0=400 1=65
Concat                   cat_21                   4 1 262 263 264 265 266 0=1
Slice                    split_10                 1 2 266 267 268 -23300=2,64,1 1=0
Reshape                  view_162                 1 1 267 269 0=34000 1=16 2=4
Permute                  transpose_164            1 1 269 270 0=2
Softmax                  softmax_156              1 1 270 271 0=0 1=1
Convolution              conv_78                  1 1 271 272 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=16
Reshape                  view_163                 1 1 272 273 0=34000 1=4
MemoryData               pnnx_fold_anchor_points.1 0 1 274 0=34000 1=2
MemoryData               pnnx_fold_anchor_points.1_1 0 1 275 0=34000 1=2
Slice                    chunk_0                  1 2 273 276 277 -23300=2,-233,-233 1=0
BinaryOp                 sub_6                    2 1 274 276 278 0=1
Split                    splitncnn_25             1 2 278 279 280
BinaryOp                 add_7                    2 1 275 277 281 0=0
Split                    splitncnn_26             1 2 281 282 283
BinaryOp                 add_8                    2 1 279 282 284 0=0
BinaryOp                 div_9                    1 1 284 285 0=3 1=1 2=2.000000e+00
BinaryOp                 sub_10                   2 1 283 280 286 0=1
Concat                   cat_22                   2 1 285 286 287 0=0
Reshape                  reshape_157              1 1 217 288 0=34000 1=1
BinaryOp                 mul_11                   2 1 287 288 289 0=2
Sigmoid                  sigmoid_155              1 1 268 290
Concat                   cat_23                   2 1 289 290 out0 0=0
